<a href="https://colab.research.google.com/github/Hoopikhoop/Nick/blob/main/PIS_06_03.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### Разветочный анализ данных

# import packages

In [17]:
import pandas as pd
import numpy as np
from IPython.display import display

# data import

In [18]:
data = pd.read_csv("https://archive.ics.uci.edu/ml/machine-learning-databases/glass/glass.data", header = None)
data.head(3)

   0        1      2     3     4      5     6     7    8    9   10
0   1  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0   1
1   2  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0   1
2   3  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0   1

In [19]:
names = ["Id", "RI", "Na", "Mg", "Al", "Si", "K", "Ca", "Ba", "Fe", "Class"]
data.columns = names
data = data.drop(columns=['Id'])
data.head(3)

        RI     Na    Mg    Al     Si     K    Ca   Ba   Fe  Class
0  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0      1
1  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0      1
2  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0      1

In [20]:
data['Class'].replace(
    {
     1:"building_float",
     2:"building_non_float",
     3:"vehicle_float",
     4:"vehicle_non_float",
     5:"containers",
     6:"tableware",
     7:"headlamps"
    }, inplace=True)
data.head(5)

        RI     Na    Mg    Al     Si     K    Ca   Ba   Fe           Class
0  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0  building_float
1  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0  building_float
2  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0  building_float
3  1.51766  13.21  3.69  1.29  72.61  0.57  8.22  0.0  0.0  building_float
4  1.51742  13.27  3.62  1.24  73.08  0.55  8.07  0.0  0.0  building_float

In [21]:
for col in data.columns:
  fr = np.random.randint(5,10)/100
  data.loc[data.sample(frac=fr).index, col] = np.nan
data.head()

        RI     Na    Mg    Al     Si     K    Ca   Ba   Fe           Class
0  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0  building_float
1  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0             NaN
2  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0             NaN
3  1.51766    NaN   NaN  1.29  72.61  0.57  8.22  0.0  0.0  building_float
4  1.51742  13.27  3.62  1.24  73.08  0.55  8.07  0.0  0.0  building_float

# Data vizualization

In [22]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 214 entries, 0 to 213
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RI      203 non-null    float64
 1   Na      201 non-null    float64
 2   Mg      199 non-null    float64
 3   Al      199 non-null    float64
 4   Si      195 non-null    float64
 5   K       195 non-null    float64
 6   Ca      195 non-null    float64
 7   Ba      201 non-null    float64
 8   Fe      203 non-null    float64
 9   Class   201 non-null    object
dtypes: float64(9), object(1)
memory usage: 16.8+ KB

In [23]:
data.describe()

               RI          Na          Mg  ...          Ca          Ba          Fe
count  203.000000  201.000000  199.000000  ...  195.000000  201.000000  203.000000
mean     1.518364   13.414179    2.688593  ...    8.945282    0.165721    0.054138
std      0.003047    0.820725    1.430556  ...    1.428038    0.489694    0.095940
min      1.511150   10.730000    0.000000  ...    5.430000    0.000000    0.000000
25%      1.516525   12.890000    2.140000  ...    8.235000    0.000000    0.000000
50%      1.517680   13.300000    3.480000  ...    8.600000    0.000000    0.000000
75%      1.519155   13.830000    3.605000  ...    9.165000    0.000000    0.090000
max      1.533930   17.380000    4.490000  ...   16.190000    3.150000    0.510000

[8 rows x 9 columns]

In [25]:
display (data['Class'].describe())
print('+++++++++++++++++++++++++++++++')
display (data['Class'].value_counts())

count                    201
unique                     6
top       building_non_float
freq                      72
Name: Class, dtype: object

+++++++++++++++++++++++++++++++

building_non_float    72
building_float        64
headlamps             29
vehicle_float         16
containers            13
tableware              7
Name: Class, dtype: int64